{"format": "graph-model", "generatedBy": "2.6.0", "convertedBy": "TensorFlow.js Converter v3.9.0", "signature": {"inputs": {"x": {"name": "x:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "32"}, {"size": "128"}, {"size": "3"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "32"}, {"size": "127"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential/dense/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/dense/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/dense/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/dense/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/dense/Tensordot/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "127"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/zeros_1/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/Read_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/Read_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/zeros_1/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/ReverseV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/Read_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/Read_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros_1/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1152"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/Read_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros_1/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/ReverseV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1152"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/Read_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/Read_2/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/intermediate_layer_getter/block_1_pad/Pad/paddings", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/ReverseV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/ReverseV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/dense/Tensordot/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/dense/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/dense/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/dense/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "127"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "x", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "32"}, {"size": "128"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/intermediate_layer_getter/Conv1/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/intermediate_layer_getter/Conv1/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/intermediate_layer_getter/expanded_conv_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/intermediate_layer_getter/expanded_conv_depthwise/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/intermediate_layer_getter/expanded_conv_project/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/intermediate_layer_getter/expanded_conv_project/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/intermediate_layer_getter/block_1_expand/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "96"}]}}}}}, {"name": "StatefulPartitionedCall/intermediate_layer_getter/block_1_expand/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/intermediate_layer_getter/block_1_depthwise/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/intermediate_layer_getter/block_1_depthwise/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/intermediate_layer_getter/block_1_project/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "24"}]}}}}}, {"name": "StatefulPartitionedCall/intermediate_layer_getter/block_1_project/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/intermediate_layer_getter/block_2_expand/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "24"}, {"size": "144"}]}}}}}, {"name": "StatefulPartitionedCall/intermediate_layer_getter/block_2_expand/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}}}, {"name": "StatefulPartitionedCall/intermediate_layer_getter/block_2_depthwise/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "144"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/intermediate_layer_getter/block_2_depthwise/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}}}, {"name": "StatefulPartitionedCall/intermediate_layer_getter/block_2_project/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "144"}, {"size": "24"}]}}}}}, {"name": "StatefulPartitionedCall/intermediate_layer_getter/block_2_project/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/intermediate_layer_getter/block_3_expand/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "24"}, {"size": "144"}]}}}}}, {"name": "StatefulPartitionedCall/intermediate_layer_getter/block_3_expand/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/enter/_241", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/Read/ReadVariableOp"], "attr": {"parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsXzEvZm9yd2FyZF9sc3RtXzEvUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/enter/_242", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/Read_1/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsXzEvZm9yd2FyZF9sc3RtXzEvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/enter/_243", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/Read_2/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsXzEvZm9yd2FyZF9sc3RtXzEvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/enter/_235", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/time"], "attr": {"parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsXzEvZm9yd2FyZF9sc3RtXzEvUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/enter/_233", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/loop_counter"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsXzEvZm9yd2FyZF9sc3RtXzEvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/enter/_301", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/Read/ReadVariableOp"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsXzEvYmFja3dhcmRfbHN0bV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/enter/_302", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/Read_1/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsXzEvYmFja3dhcmRfbHN0bV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/enter/_303", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/Read_2/ReadVariableOp"], "attr": {"parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsXzEvYmFja3dhcmRfbHN0bV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/enter/_295", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/time"], "attr": {"parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsXzEvYmFja3dhcmRfbHN0bV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_121", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/Read/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2ZvcndhcmRfbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_122", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/Read_1/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2ZvcndhcmRfbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_123", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/Read_2/ReadVariableOp"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2ZvcndhcmRfbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_115", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/time"], "attr": {"T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2ZvcndhcmRfbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_113", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/loop_counter"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2ZvcndhcmRfbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_181", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/Read/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2JhY2t3YXJkX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_182", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/Read_1/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2JhY2t3YXJkX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_183", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/Read_2/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2JhY2t3YXJkX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_175", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/time"], "attr": {"parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2JhY2t3YXJkX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_173", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/loop_counter"], "attr": {"T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2JhY2t3YXJkX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/enter/_293", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/loop_counter"], "attr": {"T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsXzEvYmFja3dhcmRfbHN0bV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/intermediate_layer_getter/Conv1_relu/Relu6", "op": "_FusedConv2D", "input": ["x", "StatefulPartitionedCall/intermediate_layer_getter/Conv1/Conv2D_weights", "StatefulPartitionedCall/intermediate_layer_getter/Conv1/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/merge/_252", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/enter/_241", "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/next_iteration/_288"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/merge/_253", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/enter/_242", "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/next_iteration/_289"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/merge/_254", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/enter/_243", "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/next_iteration/_290"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/merge/_246", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/enter/_235", "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/next_iteration/_282"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/merge/_244", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/enter/_233", "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/next_iteration/_280"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/merge/_312", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/enter/_301", "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/next_iteration/_348"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/merge/_313", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/enter/_302", "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/next_iteration/_349"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/merge/_314", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/enter/_303", "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/next_iteration/_350"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/merge/_306", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/enter/_295", "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/next_iteration/_342"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_132", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_121", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/next_iteration/_168"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_133", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_122", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/next_iteration/_169"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_134", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_123", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/next_iteration/_170"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_126", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_115", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/next_iteration/_162"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_124", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_113", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/next_iteration/_160"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/merge/_192", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_181", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/next_iteration/_228"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/merge/_193", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_182", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/next_iteration/_229"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/merge/_194", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_183", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/next_iteration/_230"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/merge/_186", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_175", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/next_iteration/_222"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/merge/_184", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_173", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/next_iteration/_220"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/merge/_304", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/enter/_293", "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/next_iteration/_340"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/intermediate_layer_getter/expanded_conv_depthwise/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["StatefulPartitionedCall/intermediate_layer_getter/Conv1_relu/Relu6", "StatefulPartitionedCall/intermediate_layer_getter/expanded_conv_depthwise/depthwise_weights", "StatefulPartitionedCall/intermediate_layer_getter/expanded_conv_depthwise/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/intermediate_layer_getter/expanded_conv_project_BN/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/intermediate_layer_getter/expanded_conv_depthwise/depthwise", "StatefulPartitionedCall/intermediate_layer_getter/expanded_conv_project/Conv2D_weights", "StatefulPartitionedCall/intermediate_layer_getter/expanded_conv_project/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/intermediate_layer_getter/block_1_expand_relu/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/intermediate_layer_getter/expanded_conv_project_BN/FusedBatchNormV3", "StatefulPartitionedCall/intermediate_layer_getter/block_1_expand/Conv2D_weights", "StatefulPartitionedCall/intermediate_layer_getter/block_1_expand/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/intermediate_layer_getter/block_1_pad/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/intermediate_layer_getter/block_1_expand_relu/Relu6", 